{notes:[{id:'1',Word:'HTML',Translate:'Язык разметки гипертекста',Tag:'markup',Description:'asdasda'},{id:'2',Word:'CSS',Translate:'Каскадные таблицы стилей',Tag:'styles',Description:'CSS управляет внешним видом HTML-документа: цветами, шрифтами, отступами, расположением элементов и анимациями. Поддерживает каскадность, наследование и специфичность, что позволяет гибко управлять стилями в больших проектах.'},{id:'3',Word:'JavaScript',Translate:'Язык программирования',Tag:'language',Description:'JavaScript — основной язык программирования во фронтенде. Используется для обработки событий, управления DOM, выполнения асинхронных операций и взаимодействия с сервером. Работает в браузере и поддерживает современные парадигмы программирования.'},{id:'4',Word:'DOM',Translate:'Объектная модель документа',Tag:'browser',Description:'DOM представляет HTML-документ в виде дерева объектов, с которым может взаимодействовать JavaScript. Позволяет динамически изменять структуру страницы, стили и содержимое без перезагрузки.'},{id:'5',Word:'BOM',Translate:'Объектная модель браузера',Tag:'browser',Description:'BOM предоставляет доступ к объектам браузера, таким как window, location, history и navigator. Используется для работы с URL, историей переходов, размерами окна и системной информацией.'},{id:'6',Word:'Flexbox',Translate:'Гибкая модель компоновки',Tag:'css',Description:'Flexbox — CSS-модель раскладки, предназначенная для выравнивания элементов в одном направлении: строке или колонке. Упрощает центрирование, распределение пространства и адаптивные интерфейсы.'},{id:'7',Word:'Grid',Translate:'Сеточная система',Tag:'css',Description:'CSS Grid — мощная система двумерной раскладки. Позволяет управлять строками и колонками одновременно, строить сложные макеты и адаптивные интерфейсы без хака и вложенных контейнеров.'},{id:'8',Word:'Responsive',Translate:'Адаптивный дизайн',Tag:'ui',Description:'Адаптивный дизайн обеспечивает корректное отображение интерфейса на разных устройствах и разрешениях экрана. Реализуется с помощью гибких сеток, медиа-запросов и относительных единиц измерения.'},{id:'9',Word:'Media Query',Translate:'Медиа-запрос',Tag:'css',Description:'Media Query позволяет применять CSS-стили в зависимости от характеристик устройства, таких как ширина экрана, ориентация и плотность пикселей. Ключевой инструмент адаптивной вёрстки.'},{id:'10',Word:'Viewport',Translate:'Область просмотра',Tag:'browser',Description:'Viewport — это видимая область веб-страницы в браузере. Контролируется мета-тегом viewport и влияет на масштабирование и поведение адаптивного дизайна.'},{id:'11',Word:'SPA',Translate:'Одностраничное приложение',Tag:'architecture',Description:'SPA загружает HTML один раз, а дальнейшие переходы выполняются без перезагрузки страницы. Это повышает отзывчивость интерфейса и позволяет создавать сложные веб-приложения.'},{id:'12',Word:'MPA',Translate:'Многостраничное приложение',Tag:'architecture',Description:'MPA состоит из множества отдельных страниц, каждая из которых загружается с сервера. Подходит для классических сайтов и проектов с упором на SEO.'},{id:'13',Word:'CSR',Translate:'Рендеринг на клиенте',Tag:'render',Description:'При CSR HTML генерируется в браузере с помощью JavaScript. Сервер обычно возвращает минимальный HTML и JS-бандл.'},{id:'14',Word:'SSR',Translate:'Рендеринг на сервере',Tag:'render',Description:'SSR формирует HTML на сервере перед отправкой в браузер. Улучшает SEO и ускоряет первый рендер страницы.'},{id:'15',Word:'SSG',Translate:'Статическая генерация',Tag:'render',Description:'SSG генерирует HTML-файлы на этапе сборки. Отлично подходит для документации, блогов и лендингов.'},{id:'16',Word:'React',Translate:'Библиотека UI',Tag:'framework',Description:'React — библиотека для создания пользовательских интерфейсов на основе компонентов. Использует виртуальный DOM и декларативный подход.'},{id:'17',Word:'Vue',Translate:'Фреймворк',Tag:'framework',Description:'Vue — прогрессивный JS-фреймворк с низким порогом входа. Поддерживает реактивность и компонентную архитектуру.'},{id:'18',Word:'Angular',Translate:'Фреймворк',Tag:'framework',Description:'Angular — мощный фреймворк с встроенными инструментами для разработки масштабных приложений.'},{id:'19',Word:'JSX',Translate:'Синтаксис расширения JS',Tag:'react',Description:'JSX позволяет писать HTML-подобный код прямо в JavaScript. Используется в React для описания UI.'},{id:'20',Word:'Component',Translate:'Компонент',Tag:'ui',Description:'Компонент — независимый и переиспользуемый элемент интерфейса, инкапсулирующий логику и отображение.'}]}